package Java_Exeption;
//==
//        4. 📔 Реализуйте класс MyArray, для работы с массивом. В нём должен быть метод checkArray(Integer[] arr), принимающий в качестве аргумента целочисленный одномерный массив.
//        Метод должен пройтись по каждому элементу и проверить что он не равен null.
//        А теперь реализуйте следующую логику:
//
//        4.1. Если в какой-то ячейке встретился null, то необходимо “оповестить” об этом пользователя
//        4.2. Если null’ы встретились в нескольких ячейках, то идеально было бы все их “подсветить”
//
//        Описать ещё один класс для работы c MyArray и продумать возможные ошибки. Все ошибки кодом описывать не обязательно, но указать на возможные уязвимости желательно
//public class Sem1_1 {
//    Application.run();
//}
//}
//
//class MyArray {
////    private int size;
//    private Integer[] arr;
//
//    public void Integer[] checkArray(Integer[] arr){
//        for (int i=0; i<arr.length; i++){
//            if(!arr[i].equals(null)){
//            } else{
//                System.out.println("Is null" + arr[i]);
//            }
//        }
//        return
//    }
//
//
////    public MyArray(int size) {
////        this.arr = new int[size];
////    }
//}
//
//class MyArrayApi {
//    MyArray ma;
//
//    public MyArrayApi(MyArray myArray) {
//        ma = myArray;
//    }
//
//    public void build() {
//        Integer[] col = { 1, 321, 32, 3, null, null };
//
//    }
//}
//
//class Application {
//    static void run() {
//        MyArrayApi mapi = new MyArrayApi(null);
//        mapi.build();
//    }
//}
//


